"""Python基础测评"""
"""
    一、判断变量类型
        1.元组中只有一个元素时必须要带逗号，否则就不是元组
        2.花括号中没有元素时，为空字典，空集合用set()表示
        3.花括号中有不可变元素，没有键值对，为集合
        4.集合中的元素必须为不可变类型
        5.集合中必须放frozenset，任何可变元素包括集合都不可以（集合是可变的）
        6.科学计数法表示的数据为浮点型
        7.\"表示的是"
        8.字典的键必须为不可变类型，值可以是任何类型
    
    二、
        可变数据类型：列表 字典 集合
        不可变数据类型：数字 字符串 元组 
        序列：列表 字符串 元组
        非序列：数字 字典 集合

    三、
        1.None是关键字 "None"是字符串
        2.字符串的bool值都为True，0和1分别代表False和True
        3.注意短路原则，可以直接得出结果的可以不用计算其他的部分
        
    四、  is是身份运算符 判断地址是否相同
          ==是比较运算符 判断值是否相同
"""
"""
勤记笔记！
"""