"""条件语句"""
"""
    格式：记得带冒号
        1.  if 判断条件：
                执行语句

        2.  if 判断条件：
                执行语句
            else：
                执行语句

        3.  if 判断条件1：
                执行语句
            elif 判断条件2：
                执行语句
            elif 判断条件3：
                执行语句
            else：
                执行语句

        4.三元表达式：它是一个表达式，而不是一个结构化的代码块
            1.形式：执行语句 if 判断条件 else 执行语句
            2.三元表达式相当于一个值，根据条件判断输出：值 if 判断条件 else 值 if 判断条件 else 值......
            3.三元表达式内可以用海象赋值法

    条件语句的特点：
        1.每个条件语句只会满足一次结果，后面的就不会执行了
        2.进行bool判断时，任何非零/非None/非空值为True，反之为False
"""

"""模块导入"""
"""
    1.import 模块名 
    2.imoprt 模块名 as 别名
    3.from 模块名/件夹名.模块名 import 函数名/变量名/....../* as 别名
"""